Success to transfer the image with `160de6e4a2963116ed0cef286742a398517d2882` - Firewall had always 443 and 54323 open to the engine. I don't think more is needed? https://access.redhat.com/documentation/en-us/red_hat_virtualization/4.3/html/planning_and_prerequisites_guide/rhv_requirements

```
$ terraform apply
data.ovirt_clusters.clusters: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ovirt_image_transfer.fcos_transfer will be created
  + resource "ovirt_image_transfer" "fcos_transfer" {
      + alias             = "fcos31"
      + disk_id           = (known after apply)
      + id                = (known after apply)
      + source_url        = "/home/mh/privat/home_net/ovirt-lab/fedora-coreos-31.20200210.3.0-openstack.x86_64.qcow2"
      + sparse            = true
      + storage_domain_id = "d3d21d97-3ec9-4b37-b0e0-f94f0851d808"
    }

  # ovirt_template.fcos_template will be created
  + resource "ovirt_template" "fcos_template" {
      + clone             = false
      + cluster_id        = "7ceaf68d-09b5-4015-9444-7cdfcdd81aef"
      + cores             = 1
      + high_availability = false
      + id                = (known after apply)
      + name              = "template-for-fcos31"
      + sockets           = 1
      + status            = (known after apply)
      + threads           = 1
      + vm_id             = (known after apply)
    }

  # ovirt_vm.tmpvm will be created
  + resource "ovirt_vm" "tmpvm" {
      + clone             = false
      + cluster_id        = "7ceaf68d-09b5-4015-9444-7cdfcdd81aef"
      + cores             = 1
      + high_availability = false
      + id                = (known after apply)
      + name              = "tmpvm-for-fcos31"
      + sockets           = 1
      + status            = (known after apply)
      + template_id       = "00000000-0000-0000-0000-000000000000"
      + threads           = 1

      + block_device {
          + active               = true
          + disk_id              = (known after apply)
          + interface            = "virtio_scsi"
          + read_only            = false
          + use_scsi_reservation = false
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ovirt_image_transfer.fcos_transfer: Creating...
ovirt_image_transfer.fcos_transfer: Still creating... [10s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [20s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [30s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [40s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [50s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [1m0s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [1m10s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [1m20s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [1m30s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [1m40s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [1m50s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [2m0s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [2m10s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [2m20s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [2m30s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [2m40s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [2m50s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [3m0s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [3m10s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [3m20s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [3m30s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [3m40s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [3m50s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [4m0s elapsed]
ovirt_image_transfer.fcos_transfer: Still creating... [4m10s elapsed]
ovirt_image_transfer.fcos_transfer: Creation complete after 4m17s [id=f3b95c1d-ae98-45dd-b3f3-35993471baae]
ovirt_vm.tmpvm: Creating...
ovirt_vm.tmpvm: Still creating... [10s elapsed]
ovirt_vm.tmpvm: Still creating... [20s elapsed]
ovirt_vm.tmpvm: Still creating... [30s elapsed]
ovirt_vm.tmpvm: Still creating... [40s elapsed]
ovirt_vm.tmpvm: Still creating... [50s elapsed]
ovirt_vm.tmpvm: Still creating... [1m0s elapsed]
ovirt_vm.tmpvm: Still creating... [1m10s elapsed]
ovirt_vm.tmpvm: Still creating... [1m20s elapsed]
ovirt_vm.tmpvm: Still creating... [1m30s elapsed]
ovirt_vm.tmpvm: Creation complete after 1m37s [id=36c0037b-3aaa-4ed5-b344-dc61f1a7cfa3]
ovirt_template.fcos_template: Creating...
ovirt_template.fcos_template: Still creating... [10s elapsed]
ovirt_template.fcos_template: Still creating... [20s elapsed]
ovirt_template.fcos_template: Still creating... [30s elapsed]
ovirt_template.fcos_template: Still creating... [40s elapsed]
ovirt_template.fcos_template: Still creating... [50s elapsed]
ovirt_template.fcos_template: Still creating... [1m0s elapsed]
ovirt_template.fcos_template: Still creating... [1m10s elapsed]
ovirt_template.fcos_template: Still creating... [1m20s elapsed]
ovirt_template.fcos_template: Still creating... [1m30s elapsed]
ovirt_template.fcos_template: Creation complete after 1m33s [id=2de0ceb9-1011-47e8-8fa9-b4c78f2be624]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

